				 ---------------------------------------------------------------
                 --                      ТАБЛИЦІ                               --
				 ---------------------------------------------------------------

-- -----------------------------------------------------
-- Table підрозділи
-- -----------------------------------------------------
CREATE TABLE IF NOT EXISTS підрозділи (
  ід SERIAL NOT NULL PRIMARY KEY,
  назва VARCHAR(25) NOT NULL,
  адреса VARCHAR(55) NOT NULL);

INSERT INTO підрозділи (назва, адреса) VALUES
('Відділення №21', 'м. Івано-Франківськ вул. Вовчинецька 225а');

SELECT * FROM підрозділи;

-- -----------------------------------------------------
-- Table штатний_розпис
-- -----------------------------------------------------
CREATE TABLE IF NOT EXISTS штатний_розпис (
  ід SERIAL NOT NULL PRIMARY KEY,
  назва_посади VARCHAR(40) NOT NULL,
  планова_кількість_працівників INT NOT NULL,
  "обов`язки" VARCHAR(200) NULL,
  профіль_компетенції VARCHAR(150) NULL,
  оклад MONEY NOT NULL,
  надбавка MONEY NOT NULL,
  ід_підрозділу INT NOT NULL REFERENCES підрозділи(ід));

INSERT INTO штатний_розпис (назва_посади, планова_кількість_працівників, оклад, надбавка, ід_підрозділу) VALUES
('касир', '25', '19000', '1000', 1);

SELECT * FROM штатний_розпис;

ALTER TABLE штатний_розпис DROP COLUMN надбавка;

ALTER TABLE штатний_розпис ALTER COLUMN price SET DEFAULT 7.77;

-- -----------------------------------------------------
-- Table працівники
-- -----------------------------------------------------
CREATE TYPE gender AS ENUM('чоловік', 'жінка');

CREATE TYPE marital_status AS ENUM('незаміжня/неодружений', 'заміжня/одружений', 'розлучена/розлучений', 'вдова/вдівець');

CREATE TABLE IF NOT EXISTS працівники (
  ід SERIAL NOT NULL PRIMARY KEY,
  ПІБ VARCHAR(55) NOT NULL,
  ІПН VARCHAR(10) NOT NULL,
  дата_народження DATE NOT NULL,
  адреса_проживання VARCHAR(55) NOT NULL,
  номер_телефону VARCHAR(13) NOT NULL,
  електронна_пошта VARCHAR(25) NULL,
  стать gender NOT NULL,
  сімейний_стан marital_status NOT NULL,
  паспортні_дані VARCHAR(10) NOT NULL,
  дата_прийняття DATE NOT NULL,
  дата_звільнення DATE NULL,
  ід_штатного_розпису INT NOT NULL REFERENCES штатний_розпис(ід));
drop table працівники;

ALTER TABLE працівники ADD COLUMN дата_звільнення DATE NULL;

INSERT INTO працівники (ПІБ, ІПН, дата_народження, адреса_проживання, номер_телефону, стать, сімейний_стан, паспортні_дані, дата_прийняття, ід_штатного_розпису) VALUES
('Стражник Ірина Володимирівна', '32855961', '22-07-2002', 'м. Івано-Франківськ вул. Докучаєва 4/2', '+380997080125', 'жінка', 'незаміжня/неодружений', '0123456789', '12-02-2009', 1);

ALTER TABLE працівники ADD COLUMN надбавка MONEY NOT NULL DEFAULT 0;

SELECT * FROM працівники;

-- -----------------------------------------------------
-- Table довідник_валют
-- -----------------------------------------------------
CREATE TABLE IF NOT EXISTS довідник_валют (
  ід SERIAL NOT NULL PRIMARY KEY,
  назва VARCHAR(20) NOT NULL,
  коротка_назва VARCHAR(5) NOT NULL,
  символ VARCHAR(5) NULL,
  країна_валюти VARCHAR(25) NOT NULL);

SELECT * FROM довідник_валют; 

INSERT INTO довідник_валют(назва, коротка_назва, символ, країна_валюти) VALUES
('гривня', 'грн', '₴', 'Україна');

INSERT INTO довідник_валют(назва, коротка_назва, символ, країна_валюти) VALUES
('долар США', 'USD', '$', 'США');

-- -----------------------------------------------------
-- Table курси_валют
-- -----------------------------------------------------
CREATE TABLE IF NOT EXISTS курси_валют (
  ід SERIAL NOT NULL PRIMARY KEY,
  дата_час_встановлення_курсу TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
  вартість_придбання MONEY NOT NULL,
  вартіть_продажі MONEY NOT NULL,
  ід_валюти INT NOT NULL REFERENCES довідник_валют(ід));

SELECT * FROM курси_валют; 

INSERT INTO курси_валют(дата_час_встановлення_курсу, вартість_придбання, вартіть_продажі, ід_валюти) VALUES
(DEFAULT, 27.4, 27.5, 2);

ALTER TABLE курси_валют ALTER COLUMN дата_час_встановлення_курсу TYPE TIMESTAMPTZ;
ALTER TABLE курси_валют ALTER COLUMN дата_час_встановлення_курсу SET DEFAULT CURRENT_TIMESTAMP;

-- -----------------------------------------------------
-- Table фізичні_особи
-- -----------------------------------------------------
CREATE TABLE IF NOT EXISTS фізичні_особи (
  ід SERIAL NOT NULL PRIMARY KEY,
  ПІБ VARCHAR(55) NOT NULL,
  дата_реєстрації DATE DEFAULT CURRENT_DATE,
  дата_народження DATE NOT NULL,
  номер_телефону VARCHAR(13) NOT NULL,
  електронна_пошта VARCHAR(25) NULL,
  адреса_проживання VARCHAR(55) NOT NULL,
  паспортні_дані VARCHAR(9) NOT NULL,
  ІПН VARCHAR(10) NOT NULL,
  стать gender NOT NULL,
  сімейний_стан marital_status NOT NULL);
  
  SELECT * FROM фізичні_особи;
  
  INSERT INTO фізичні_особи(ПІБ, дата_народження, номер_телефону, адреса_проживання, паспортні_дані, ІПН, стать, сімейний_стан) VALUES
  ('Андрушко Анна Ігорівна', '12.09.1998', '+380997867345', 'вул. Вовчинецька 225/16', '645387021', '3245176888', 'жінка', 'незаміжня/неодружений');
  ALTER TABLE фізичні_особи ADD COLUMN дата_реєстрації TIMESTAMPTZ;
  ALTER TABLE фізичні_особи ALTER COLUMN дата_реєстрації SET DEFAULT CURRENT_TIMESTAMP;
-- -----------------------------------------------------
-- Table журнал_касових_операцій 
-- -----------------------------------------------------

CREATE TYPE payment_type AS ENUM('картка', 'готівка');

CREATE TABLE IF NOT EXISTS журнал_касових_операцій (
  ід SERIAL NOT NULL PRIMARY KEY,
  дата_час_проведення TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP,
  ід_фізичної_особи INT NOT NULL REFERENCES фізичні_особи(ід),
  ід_працівника INT NOT NULL REFERENCES працівники(ід));
  
  ALTER TABLE журнал_касових_операцій ADD COLUMN тип_оплати payment_type NOT NULL;

  ALTER TABLE журнал_касових_операцій ALTER COLUMN дата_час_проведення TYPE TIMESTAMPTZ;
  ALTER TABLE журнал_касових_операцій ALTER COLUMN дата_час_проведення SET DEFAULT CURRENT_TIMESTAMP; 
  
INSERT INTO журнал_касових_операцій(ід_фізичної_особи, ід_працівника, тип_оплати) VALUES 
(1, 5, 'картка')
SELECT * FROM журнал_валютообмінних_операцій

-- -----------------------------------------------------
-- Table журнал_поповнень_мобільних
-- -----------------------------------------------------
CREATE TABLE IF NOT EXISTS журнал_поповнень_мобільних (
  ід SERIAL NOT NULL PRIMARY KEY,
  оператор VARCHAR(25),
  номер_отримувача VARCHAR(13) NOT NULL,
  сума MONEY NOT NULL,
  комісія MONEY DEFAULT 0,
  журнал_касових_операцій_ід INT NOT NULL REFERENCES журнал_касових_операцій(ід));

-- -----------------------------------------------------
-- Table журнал_валютообмінних_операцій
-- -----------------------------------------------------
CREATE TABLE IF NOT EXISTS журнал_валютообмінних_операцій (
  ід SERIAL NOT NULL PRIMARY KEY,
  сума_валюти_купівлі MONEY NOT NULL DEFAULT 0,
  сума_валюти_обміну MONEY NOT NULL DEFAULT 0,
  комісія MONEY DEFAULT 0,
  ід_валюти INT NOT NULL REFERENCES довідник_валют(ід),
  журнал_касових_операцій_ід INT NOT NULL REFERENCES журнал_касових_операцій(ід));
  select * from журнал_валютообмінних_операцій
  INSERT INTO журнал_валютообмінних_операцій(сума_валюти_купівлі, ід_валюти, журнал_касових_операцій_ід) VALUES
  (200, 2, 2)

	ALTER TABLE журнал_валютообмінних_операцій ADD COLUMN ід_валюти_купівлі INT REFERENCES довідник_валют(ід)
	
-- -----------------------------------------------------
-- Table тарифи_для_фізичних_осіб
-- -----------------------------------------------------
CREATE TABLE IF NOT EXISTS тарифи_для_фізичних_осіб (
  ід SERIAL NOT NULL PRIMARY KEY,
  назва VARCHAR(45) NOT NULL,
  комісія NUMERIC(3,2) NOT NULL DEFAULT 0);

INSERT INTO тарифи_для_фізичних_осіб(назва, комісія, фіксована_комісія) VALUES
('Договірний', '0.1', '1.5');

-- -----------------------------------------------------
-- Table види_карт
-- -----------------------------------------------------
CREATE TABLE IF NOT EXISTS види_карт (
  ід SERIAL NOT NULL PRIMARY KEY,
  назва VARCHAR(30) NOT NULL,
  опис VARCHAR(100) NULL,
  ід_тарифу INT NOT NULL REFERENCES тарифи_для_фізичних_осіб(ід),
  ід_валюти INT NOT NULL REFERENCES довідник_валют(ід));

INSERT INTO види_карт(назва, ід_тарифу, ід_валюти) VALUES
('Кредитна', 1, 1);

-- -----------------------------------------------------
-- Table карткові_рахунки
-- -----------------------------------------------------
CREATE TABLE IF NOT EXISTS карткові_рахунки (
  ід SERIAL NOT NULL PRIMARY KEY,
  номер_рахунку VARCHAR(16) NOT NULL,
  залишок MONEY NOT NULL DEFAULT 0,
  види_карт_ід INT NOT NULL REFERENCES види_карт(ід),
  ід_фізичної_особи INT NOT NULL REFERENCES фізичні_особи(ід));

INSERT INTO карткові_рахунки(номер_рахунку, залишок, види_карт_ід, ід_фізичної_особи) VALUES
('4545657898234563', 1025, 1, 1);

-- -----------------------------------------------------
-- Table журнал_поповнень_карткових_рахунків
-- -----------------------------------------------------
CREATE TABLE IF NOT EXISTS журнал_поповнень_карткових_рахунків (
  ід SERIAL NOT NULL PRIMARY KEY,
  сума_операції MONEY NOT NULL,
  картка_отримувача VARCHAR(16) NOT NULL,
  комісія MONEY DEFAULT 0,
  коментар VARCHAR(50) NULL,
  ід_операції_журналу_операцій INT NOT NULL REFERENCES журнал_касових_операцій(ід));
  
  ALTER TABLE журнал_поповнень_карткових_рахунків DROP COLUMN комісія;  
  ALTER TABLE журнал_поповнень_карткових_рахунків ADD COLUMN комісія MONEY DEFAULT 0;
  
  ALTER TABLE журнал_поповнень_карткових_рахунків ADD COLUMN ід_картки_клієнта INT REFERENCES карткові_рахунки(ід);

-- -----------------------------------------------------
-- Table журнал_поповнень_розрахункових_рахунків
-- -----------------------------------------------------
CREATE TABLE IF NOT EXISTS журнал_поповнень_розрахункових_рахунків (
  ід SERIAL NOT NULL PRIMARY KEY,
  сума_валюти_платежу MONEY NOT NULL,
  комісія MONEY DEFAULT 0,
  ід_валюти INT NOT NULL REFERENCES довідник_валют(ід),
  коментар VARCHAR(40) NULL,
  фізичні_особи_ід INT NOT NULL REFERENCES фізичні_особи(ід),
  журнал_касових_операцій_ід INT NOT NULL REFERENCES журнал_касових_операцій(ід));
  
  ALTER TABLE журнал_поповнень_розрахункових_рахунків DROP CONSTRAINT ід_картки_клієнта;
  
  ALTER TABLE журнал_поповнень_розрахункових_рахунків DROP COLUMN ід_картки_клієнта;  
  ALTER TABLE журнал_поповнень_розрахункових_рахунків ADD COLUMN комісія MONEY DEFAULT 0;
  
  ALTER TABLE журнал_поповнень_розрахункових_рахунків ADD COLUMN ід_картки_клієнта INT REFERENCES карткові_рахунки(ід);


-- -----------------------------------------------------
-- Table юридичні_особи
-- -----------------------------------------------------
CREATE TABLE IF NOT EXISTS юридичні_особи (
  ід SERIAL NOT NULL PRIMARY KEY,
  дата_реєстрації DATE NOT NULL DEFAULT CURRENT_DATE,
  повна_назва VARCHAR(50) NOT NULL,
  коротка_назва VARCHAR(25) NOT NULL,
  юридична_адреса VARCHAR(45) NOT NULL,
  код_єдрпоу VARCHAR(8) NOT NULL,
  ід_керівника INT NOT NULL REFERENCES фізичні_особи(ід),
  ід_бухгалтера INT NOT NULL REFERENCES фізичні_особи(ід),
  електронна_адреса VARCHAR(45) NULL,
  веб_сайт VARCHAR(45) NULL,
  вид_діяльності VARCHAR(45) NOT NULL,
  ід_менеджера INT NOT NULL REFERENCES працівники(ід));
  
  INSERT INTO юридичні_особи(повна_назва, коротка_назва, юридична_адреса, код_єдрпоу, ід_керівника, ід_бухгалтера, вид_діяльності, ід_менеджера) VALUES
  ('mvp ofice', 'mvp', 'мю Івано-Франківськ вул. Миру 45/2', '56734211', 1, 1, 'нерухомість', 5);
  
  ALTER TABLE юридичні_особи ALTER COLUMN дата_реєстрації TYPE TIMESTAMPTZ;
  ALTER TABLE юридичні_особи ALTER COLUMN дата_реєстрації SET DEFAULT CURRENT_TIMESTAMP; 

-- -----------------------------------------------------
-- Table тарифи_для_юридичних_осіб
-- -----------------------------------------------------
CREATE TABLE IF NOT EXISTS тарифи_для_юридичних_осіб (
  ід SERIAL NOT NULL PRIMARY KEY,
  назва VARCHAR(45) NOT NULL,
  відсоток_комісії_від_операції NUMERIC(5,2) NOT NULL DEFAULT 0;

  INSERT INTO тарифи_для_юридичних_осіб(назва, відсоток_комісії_від_операції, фіксована_комісія) VALUES
  ('Договірний', 3, 2);
  INSERT INTO тарифи_для_юридичних_осіб(назва, відсоток_комісії_від_операції) VALUES
  ('Кредитний віп', 1.5);
select * from тарифи_для_юридичних_осіб
-- -----------------------------------------------------
-- Table рахунки_юридичних_осіб
-- -----------------------------------------------------
CREATE TABLE IF NOT EXISTS рахунки_юридичних_осіб (
  ід SERIAL NOT NULL PRIMARY KEY,
  ід_юридичної_особи INT NOT NULL REFERENCES юридичні_особи(ід),
  тип_рахунку VARCHAR(45) NOT NULL,
  назва_рахунку VARCHAR(45) NULL,
  номер_рахунку VARCHAR(16) NOT NULL,
  ід_валюти INT NOT NULL REFERENCES довідник_валют(ід),
  залишок MONEY NOT NULL,
  ід_тарифу INT NOT NULL REFERENCES тарифи_для_юридичних_осіб(ід));
  select * from рахунки_юридичних_осіб
  INSERT INTO рахунки_юридичних_осіб(ід_юридичної_особи, тип_рахунку, номер_рахунку, ід_валюти, залишок, ід_тарифу) VALUES
  (2, 'кредитний', '1234567898765678', 1, 1220, 1);

-- -----------------------------------------------------
-- Table кредити
-- -----------------------------------------------------
CREATE TABLE IF NOT EXISTS кредити (
  ід SERIAL NOT NULL PRIMARY KEY,
  номер_договору VARCHAR(45) NOT NULL,
  дата_початку DATE NOT NULL DEFAULT CURRENT_DATE,
  термін DATE NOT NULL, -- КІЛЬКІСТЬ МІСЯЦІВ
  планова_дата_закриття DATE NULL,
  відсотки_в_місяць_строкові NUMERIC(3,2) NOT NULL,
  відсотки_в_місяць_просточені NUMERIC(3,2) NOT NULL DEFAULT 0,
  відсотки_пені NUMERIC(3,2) NOT NULL,
  дата_закриття_кредиту DATE NULL,
  сума_позики MONEY NULL,
  ід_валюти INT NOT NULL REFERENCES довідник_валют(ід),
  ід_рахунку INT NOT NULL REFERENCES рахунки_юридичних_осіб(ід));
  
  INSERT INTO кредити(номер_договору, термін, планова_дата_закриття, відсотки_в_місяць_строкові, відсотки_в_місяць_просточені, відсотки_пені, сума_позики, ід_валюти, ід_рахунку, ід_юридичної_особи) VALUES
  ('452654756732744', 24, '22.02.2022', 2, 3, 2, 10000, 1, 2, 2);
  
  ALTER TABLE кредити ADD COLUMN ід_юридичної_особи INT NOT NULL REFERENCES юридичні_особи(ід);

  select * from кредити;

  ALTER TABLE кредити ADD COLUMN термін INT;
  ALTER TABLE кредити ALTER COLUMN дата_початку SET DEFAULT CURRENT_TIMESTAMP; 

-- -----------------------------------------------------
-- Table депозити
-- -----------------------------------------------------
CREATE TYPE answer AS ENUM('так', 'ні');

CREATE TABLE IF NOT EXISTS депозити (
  ід SERIAL NOT NULL PRIMARY KEY,
  номер_договору VARCHAR(45) NOT NULL,
  дата_початку_договору DATE NOT NULL DEFAULT CURRENT_DATE,
  дата_завершення_договору DATE NULL,
  відсотки_у_місяць NUMERIC(3,2) NOT NULL,
  термін_депозиту DATE NOT NULL,
  виплата_відсотків_щомісяця answer NOT NULL,
  можливість_поповнення answer NOT NULL,
  ід_рахунку_відсотків INT NOT NULL REFERENCES рахунки_юридичних_осіб(ід),
  ід_рахунку_депозита INT NOT NULL REFERENCES рахунки_юридичних_осіб(ід));
  
  ALTER TABLE депозити ALTER COLUMN дата_початку_договору TYPE TIMESTAMPTZ;
  ALTER TABLE депозити ALTER COLUMN дата_початку_договору SET DEFAULT CURRENT_TIMESTAMP; 
  ALTER TABLE депозити ADD COLUMN ід_юридичної_особи INT NOT NULL REFERENCES юридичні_особи(ід);

-- -----------------------------------------------------
-- Table журнал_операцій_юридичних_осіб
-- -----------------------------------------------------
CREATE TABLE IF NOT EXISTS журнал_операцій_юридичних_осіб (
  ід SERIAL NOT NULL PRIMARY KEY,
  сума MONEY NOT NULL,
  ід_працівника INT NOT NULL REFERENCES працівники(ід),
  ід_рахунку_юридичної_особи INT NOT NULL REFERENCES рахунки_юридичних_осіб(ід),
  дата TIMESTAMP NOT NULL DEFAULT CURRENT_DATE,
  сума_комісії MONEY NOT NULL,
  ід_валюти INT NOT NULL REFERENCES довідник_валют(ід));
  
  ALTER TABLE журнал_операцій_юридичних_осіб ALTER COLUMN дата TYPE TIMESTAMPTZ;
  ALTER TABLE журнал_операцій_юридичних_осіб ALTER COLUMN дата SET DEFAULT CURRENT_TIMESTAMP; 
-- -----------------------------------------------------
-- Table графіки_погашень_кредитів
-- -----------------------------------------------------
CREATE TABLE IF NOT EXISTS графіки_погашень_кредитів (
  ід SERIAL NOT NULL PRIMARY KEY,
  ід_кредиту INT NOT NULL REFERENCES кредити(ід),
  залишок_до_погашення MONEY NULL, -- 
  сума_кредиту_до_погашення_згідно_графіку MONEY NULL,
  прострочений_кредит MONEY NULL,
  сума_строкових_відсотків MONEY NULL,
  сума_прострочених_відсотків MONEY NULL,
  сума_пені MONEY NULL);
  
  SELECT * FROM графіки_погашень_кредитів;
  
  INSERT INTO графіки_погашень_кредитів(ід_кредиту, залишок_до_погашення, сума_кредиту_до_погашення_згідно_графіку, прострочений_кредит, сума_строкових_відсотків, сума_прострочених_відсотків, сума_пені) VALUES 
  (4, 10000, 416.66, 0, 316, 0, 0);
  
  ALTER TABLE графіки_погашень_кредитів ADD COLUMN дата TIMESTAMPTZ;
  ALTER TABLE графіки_погашень_кредитів ALTER COLUMN дата SET DEFAULT CURRENT_TIMESTAMP; 
                 ---------------------------------------------------------------
                 --                       ЗАПИТИ                               --
				 ---------------------------------------------------------------
-- юридичні особи, яким до погашення кредиту залишається один місяць+++++
SELECT юридичні_особи.повна_назва AS юридичні_особи, фізичні_особи.ПІБ AS керівник, 
	   кредити.ід AS ід_кредиту, кредити.планова_дата_закриття
FROM юридичні_особи, фізичні_особи, кредити
WHERE фізичні_особи.ід = юридичні_особи.ід_керівника
AND юридичні_особи.ід = кредити.ід_юридичної_особи
AND кредити.планова_дата_закриття = NOW() + '1 month'::interval;

-- відсоткове співвідношення усіх карт++++++++++++++++++++++=
WITH RECURSIVE count_cards(name_card, count_made_cards) AS (
   SELECT види_карт.назва, count(картк ові_рахунки.види_карт_ід)
   FROM види_карт INNER JOIN карткові_рахунки ON види_карт.ід = карткові_рахунки.види_карт_ід
   GROUP BY види_карт.назва
   UNION
   SELECT NULL, count(карткові_рахунки.види_карт_ід)
   FROM карткові_рахунки
)
SELECT name_card, count_made_cards / (SELECT MAX(count_made_cards) FROM count_cards) * 100 
FROM count_cards;

-- загальна сума купівлі обміну кожної з валют кожної особи, посортовано по особах ?????????
SELECT фізичні_особи.ПІБ AS фізичні_особи, довідник_валют.назва AS валюта, 
	   sum(журнал_валютообмінних_операцій.сума_валюти_купівлі) AS сума_валюти_купівлі, 
	   sum(журнал_валютообмінних_операцій.сума_валюти_обміну) AS сума_валюти_обміну,
	   ROW_NUMBER() OVER (PARTITION BY фізичні_особи.ПІБ 
						  ORDER BY sum(журнал_валютообмінних_операцій.сума_валюти_купівлі) + 
						  			  sum(журнал_валютообмінних_операцій.сума_валюти_обміну) DESC) AS рейтинг  
FROM фізичні_особи, журнал_валютообмінних_операцій, журнал_касових_операцій, довідник_валют
WHERE фізичні_особи.ід = журнал_касових_операцій.ід_фізичної_особи
AND журнал_касових_операцій.ід = журнал_валютообмінних_операцій.журнал_касових_операцій_ід
AND довідник_валют.ід = журнал_валютообмінних_операцій.ід_валюти
GROUP BY фізичні_особи.ПІБ, довідник_валют.назва;

-- операції, кількість проведених операцій різними валютами+++++++++++++++++++
WITH RECURSIVE count_cards_operations(валюти, операції_обміну_валют, операції_поповнення_рахунків, відкриті_рахунки_фіз_особми, відкриті_рахунки_юрид_особми, кредити) AS ( 
SELECT довідник_валют.назва, COUNT(журнал_валютообмінних_операцій.ід_валюти),
 						    COUNT(журнал_поповнень_розрахункових_рахунків.ід_валюти),
 							COUNT(карткові_рахунки.види_карт_ід), 
 							COUNT(рахунки_юридичних_осіб.ід_валюти),
 							COUNT(кредити.ід_валюти)
FROM довідник_валют FULL OUTER JOIN журнал_валютообмінних_операцій ON довідник_валют.ід = журнал_валютообмінних_операцій.ід_валюти
FULL OUTER JOIN журнал_поповнень_розрахункових_рахунків  ON довідник_валют.ід = журнал_поповнень_розрахункових_рахунків.ід_валюти
FULL OUTER JOIN кредити ON довідник_валют.ід = кредити.ід_валюти
FULL OUTER JOIN рахунки_юридичних_осіб ON довідник_валют.ід = рахунки_юридичних_осіб.ід_валюти
FULL OUTER JOIN види_карт ON довідник_валют.ід = види_карт.ід_валюти
FULL OUTER JOIN карткові_рахунки ON довідник_валют.ід = карткові_рахунки.види_карт_ід
GROUP BY довідник_валют.назва)

-- операції, кількість проведених операцій різними валютами, посортовано кількість по операціях(PostgreSQL) +++++++++++
-- (продовження WITH RECURSIVE count_cards_operations тільки для PostgreSQL)
SELECT валюти, операції_обміну_валют, операції_поповнення_рахунків, 
	   відкриті_рахунки_фіз_особми, відкриті_рахунки_юрид_особми, кредити,
	   операції_обміну_валют + операції_поповнення_рахунків + 
	   відкриті_рахунки_фіз_особми + відкриті_рахунки_юрид_особми + 
 	   кредити AS загальна_кількість,
 	   LAG((операції_обміну_валют + операції_поповнення_рахунків + 
 			відкриті_рахунки_фіз_особми + відкриті_рахунки_юрид_особми + 
 			кредити)) OVER w - (операції_обміну_валют + операції_поповнення_рахунків + 
 								відкриті_рахунки_фіз_особми + відкриті_рахунки_юрид_особми + 
 								кредити) AS рейтинг
FROM count_cards_operations
WINDOW w AS (ORDER BY (операції_обміну_валют + операції_поповнення_рахунків + 
					   відкриті_рахунки_фіз_особми + відкриті_рахунки_юрид_особми + 
 					   кредити) DESC);

-- валюта, якою найменше та найбільше проведено операцій(MySQL)+++++++++++++++
-- (продовження WITH RECURSIVE count_cards_operations тільки для MySQL)
(SELECT 'найбільша кількість' AS тип, валюти, операції_обміну_валют + операції_поповнення_рахунків + 
	   відкриті_рахунки_фіз_особми + відкриті_рахунки_юрид_особми + 
	   кредити AS загальна_кількість
FROM count_cards_operations
ORDER BY операції_обміну_валют + операції_поповнення_рахунків + 
	     відкриті_рахунки_фіз_особми + відкриті_рахунки_юрид_особми + 
	     кредити DESC
LIMIT 1)
UNION
(SELECT 'найменша кількість' AS тип, валюти, операції_обміну_валют + операції_поповнення_рахунків + 
	   відкриті_рахунки_фіз_особми + відкриті_рахунки_юрид_особми + 
	   кредити AS загальна_кількість
FROM count_cards_operations
ORDER BY операції_обміну_валют + операції_поповнення_рахунків + 
	     відкриті_рахунки_фіз_особми + відкриті_рахунки_юрид_особми + 
	     кредити ASC
LIMIT 1);

-- клієнт, номер карти, її назва, тариф, який є найпопулярнішим+++++++++++++++++++
SELECT фізичні_особи.ПІБ AS фізичні_особи, карткові_рахунки.номер_рахунку, 
	   види_карт.назва AS види_карт, тарифи_для_фізичних_осіб.назва AS тариф
FROM фізичні_особи, карткові_рахунки, тарифи_для_фізичних_осіб, види_карт
WHERE тарифи_для_фізичних_осіб.ід = види_карт.ід_тарифу
AND види_карт.ід = карткові_рахунки.види_карт_ід
AND фізичні_особи.ід = карткові_рахунки.ід_фізичної_особи
AND тарифи_для_фізичних_осіб.ід = (SELECT ід_тарифів 
									  FROM (SELECT тарифи_для_фізичних_осіб.ід AS ід_тарифів, 
												   COUNT(карткові_рахунки.ід) AS кількість_використань
										    FROM тарифи_для_фізичних_осіб FULL OUTER JOIN види_карт 
											  ON тарифи_для_фізичних_осіб.ід = види_карт.ід_тарифу
										    FULL OUTER JOIN карткові_рахунки 
											  ON види_карт.ід = карткові_рахунки.види_карт_ід
										    GROUP BY тарифи_для_фізичних_осіб.ід
										    ORDER BY COUNT(карткові_рахунки.ід) DESC
										    LIMIT 1) AS ccc);

-- проведені операції клієнтів за останній день++++++++++++++++++++
WITH RECURSIVE clients_operations(фізичні_особи, поповнення_мобільних, операції_обміну_валют, поповнення_розрахункових_рахунків, поповнення_карткових_рахунків) AS (
SELECT фізичні_особи.ПІБ, array_agg(журнал_поповнень_мобільних.ід), 
	   array_agg(журнал_валютообмінних_операцій.ід),
	   array_agg(журнал_поповнень_розрахункових_рахунків.ід), 
	   array_agg(журнал_поповнень_карткових_рахунків.ід)
FROM фізичні_особи FULL OUTER JOIN журнал_касових_операцій ON фізичні_особи.ід = журнал_касових_операцій.ід_фізичної_особи
FULL OUTER JOIN журнал_валютообмінних_операцій ON журнал_касових_операцій.ід = журнал_валютообмінних_операцій.журнал_касових_операцій_ід
FULL OUTER JOIN журнал_поповнень_розрахункових_рахунків  ON журнал_касових_операцій.ід = журнал_поповнень_розрахункових_рахунків.журнал_касових_операцій_ід
FULL OUTER JOIN журнал_поповнень_мобільних ON журнал_касових_операцій.ід = журнал_поповнень_мобільних.журнал_касових_операцій_ід
FULL OUTER JOIN журнал_поповнень_карткових_рахунків ON журнал_касових_операцій.ід = журнал_поповнень_карткових_рахунків.ід_операції_журналу_операцій
WHERE журнал_касових_операцій.дата_час_проведення < NOW() - '1 days'::INTERVAL
GROUP BY фізичні_особи.ПІБ)
-- остання проведена операція клієнтів за останній день++++++++++++++++++++++
SELECT фізичні_особи, поповнення_мобільних[ARRAY_UPPER(поповнення_мобільних, 1)], 
       операції_обміну_валют[ARRAY_UPPER(операції_обміну_валют, 1)], 
	   поповнення_розрахункових_рахунків[ARRAY_UPPER(поповнення_розрахункових_рахунків, 1)], 
	   поповнення_карткових_рахунків[ARRAY_UPPER(поповнення_карткових_рахунків, 1)]
FROM clients_operations;

-- власники топ 3 карт+++++++++++++++++++++++++++++++++++
WITH RECURSIVE top_three(ід, карти, кількість) AS (
SELECT види_карт.ід, види_карт.назва, COUNT(карткові_рахунки.ід)
FROM види_карт INNER JOIN карткові_рахунки ON види_карт.ід = карткові_рахунки.види_карт_ід
GROUP BY види_карт.ід, види_карт.назва
ORDER BY COUNT(карткові_рахунки.ід) DESC
LIMIT 3)

-- керівники установ, власники топ 3 карт, що мають не закриті кредити(Mysql)+++++++++++++++++
SELECT фізичні_особи.ПІБ AS керівники, юридичні_особи.повна_назва AS юридичні_установи, кредити.ід AS ід_кредитів
FROM фізичні_особи, юридичні_особи, кредити, види_карт, карткові_рахунки
WHERE фізичні_особи.ід = юридичні_особи.ід_керівника
AND юридичні_особи.ід = кредити.ід_юридичної_особи
AND види_карт.ід = карткові_рахунки.види_карт_ід
AND фізичні_особи.ід = карткові_рахунки.ід_фізичної_особи
AND кредити.дата_закриття_кредиту IS NULL
AND види_карт.назва IN (SELECT карти FROM top_three);

-- скільки в середньому витрачають власники топ 3 найп карт, суми, поставлені на депозит(PostgreSQL)+++++++++++++
SELECT фізичні_особи.ПІБ AS керівники, юридичні_особи.повна_назва AS юридичні_установи, 
				ARRAY_AGG(рахунки_юридичних_осіб.залишок::NUMERIC::FLOAT)
				FILTER(WHERE карткові_рахунки.види_карт_ід = (SELECT cards[1] 
															FROM (SELECT ARRAY_AGG(ід) AS cards
															      FROM top_three) AS ccc)) AS ТОП_1,

				ARRAY_AGG(рахунки_юридичних_осіб.залишок::NUMERIC::FLOAT)
				FILTER(WHERE карткові_рахунки.види_карт_ід = (SELECT cards[2] 
															FROM (SELECT ARRAY_AGG(ід) AS cards
																  FROM top_three) AS ccc)) AS ТОП_2,
				ARRAY_AGG(рахунки_юридичних_осіб.залишок::NUMERIC::FLOAT)
				FILTER(WHERE карткові_рахунки.види_карт_ід = (SELECT cards[3] 
															FROM (SELECT ARRAY_AGG(ід) AS cards
																  FROM top_three) AS ccc)) AS ТОП_3
FROM фізичні_особи, карткові_рахунки, юридичні_особи, депозити, рахунки_юридичних_осіб
WHERE фізичні_особи.ід = карткові_рахунки.ід_фізичної_особи
AND фізичні_особи.ід = юридичні_особи.ід_керівника
AND юридичні_особи.ід = депозити.ід_юридичної_особи
AND рахунки_юридичних_осіб.ід = депозити.ід_рахунку_депозита
GROUP BY фізичні_особи.ПІБ, юридичні_особи.повна_назва

-- топ три працівники за місяць в кожному з підрозділів++++++++++++++++++++++++
SELECT * FROM
	(SELECT підрозділи.назва AS підрозділи, працівники.ПІБ AS працівники, count(журнал_касових_операцій.ід_працівника),
			rank() OVER (PARTITION BY підрозділи.назва ORDER BY count(журнал_касових_операцій.ід_працівника) DESC)
	FROM підрозділи, працівники, журнал_касових_операцій, штатний_розпис 
	WHERE підрозділи.ід = штатний_розпис.ід_підрозділу
	AND штатний_розпис.ід = працівники.ід_штатного_розпису
	AND працівники.ід = журнал_касових_операцій.ід_працівника
	GROUP BY підрозділи.назва, працівники.ПІБ) AS ccc
WHERE rank <= 3;

-- кредити з заборгованістю, яка перевищує половину суми, після планової дати закриття++++++++++++++++++++++=
SELECT * FROM
	(SELECT кредити.ід AS кредит, юридичні_особи.повна_назва AS юридична_особа, CASE
		WHEN графіки_погашень_кредитів.прострочений_кредит > (SELECT сума_позики/2 FROM кредити) THEN графіки_погашень_кредитів.прострочений_кредит
		END AS сума, графіки_погашень_кредитів.дата,
		rank() OVER (PARTITION BY кредити.ід ORDER BY графіки_погашень_кредитів.дата DESC)
	FROM кредити, юридичні_особи, графіки_погашень_кредитів
	WHERE юридичні_особи.ід = кредити.ід_юридичної_особи
	AND кредити.ід = графіки_погашень_кредитів.ід_кредиту) AS ccc
WHERE rank = 1
ORDER BY сума DESC
LIMIT 1;
-- фіз та юр особи, які витратили найб ксть коштів за останній місяць++++++++++++++++++++++++++
(SELECT фізичні_особи.ПІБ AS особи, SUM(журнал_поповнень_розрахункових_рахунків.сума_валюти_платежу +
										 журнал_поповнень_карткових_рахунків.сума_операції +
 										 журнал_поповнень_мобільних.сума) AS кошти
FROM фізичні_особи, журнал_поповнень_мобільних, 
	журнал_поповнень_карткових_рахунків, журнал_поповнень_розрахункових_рахунків, 
	журнал_касових_операцій
WHERE фізичні_особи.ід = журнал_касових_операцій.ід_фізичної_особи
AND журнал_касових_операцій.ід = журнал_поповнень_розрахункових_рахунків.журнал_касових_операцій_ід
AND журнал_касових_операцій.ід = журнал_поповнень_карткових_рахунків.ід_операції_журналу_операцій
AND журнал_касових_операцій.ід = журнал_поповнень_мобільних.журнал_касових_операцій_ід
GROUP BY фізичні_особи.ПІБ
ORDER BY SUM(журнал_поповнень_розрахункових_рахунків.сума_валюти_платежу +
				журнал_поповнень_карткових_рахунків.сума_операції +
 				журнал_поповнень_мобільних.сума) DESC
LIMIT 1)
UNION
(SELECT юридичні_особи.повна_назва AS особи, sum(журнал_операцій_юридичних_осіб.сума) AS кошти
FROM юридичні_особи, журнал_операцій_юридичних_осіб, рахунки_юридичних_осіб
WHERE рахунки_юридичних_осіб.ід = журнал_операцій_юридичних_осіб.ід_рахунку_юридичної_особи
AND юридичні_особи.ід = рахунки_юридичних_осіб.ід_юридичної_особи
GROUP BY юридичні_особи.повна_назва
ORDER BY sum(журнал_операцій_юридичних_осіб.сума) DESC
LIMIT 1);

-- особа, якій на депозитний рахунок прийшло найбільше коштів ++++++++++++++++++++++++++
SELECT юридичні_особи.повна_назва AS юридичні_особи, фізичні_особи.ПІБ AS фізичні_особи, 
		рахунки_юридичних_осіб.номер_рахунку, рахунки_юридичних_осіб.залишок
FROM юридичні_особи, рахунки_юридичних_осіб, депозити, фізичні_особи
WHERE юридичні_особи.ід = рахунки_юридичних_осіб.ід_юридичної_особи
AND рахунки_юридичних_осіб.ід = депозити.ід_рахунку_відсотків
AND фізичні_особи.ід = юридичні_особи.ід_керівника
ORDER BY рахунки_юридичних_осіб.залишок DESC
LIMIT 1;

-- працівник, кількість обслужених клієнтів КОЖНОЇ КАТЕГОРІЇ за ОСТАННІЙ місяць++++++++++++++++++
SELECT працівники.ПІБ AS працівники, COUNT(журнал_поповнень_мобільних.ід), COUNT(журнал_поповнень_карткових_рахунків.ід), 
							COUNT(журнал_поповнень_розрахункових_рахунків.ід), COUNT(журнал_валютообмінних_операцій.ід), 
							COUNT(журнал_операцій_юридичних_осіб.ід)
FROM працівники FULL OUTER JOIN журнал_операцій_юридичних_осіб ON працівники.ід = журнал_операцій_юридичних_осіб.ід_працівника
FULL OUTER JOIN журнал_касових_операцій  
	ON працівники.ід = журнал_касових_операцій.ід_працівника
FULL OUTER JOIN журнал_поповнень_мобільних 
	ON журнал_касових_операцій.ід = журнал_поповнень_мобільних.журнал_касових_операцій_ід
FULL OUTER JOIN журнал_поповнень_розрахункових_рахунків 
	ON журнал_касових_операцій.ід = журнал_поповнень_розрахункових_рахунків.журнал_касових_операцій_ід
FULL OUTER JOIN журнал_валютообмінних_операцій 
	ON журнал_касових_операцій.ід = журнал_валютообмінних_операцій.журнал_касових_операцій_ід
FULL OUTER JOIN журнал_поповнень_карткових_рахунків 
	ON журнал_касових_операцій.ід = журнал_поповнень_карткових_рахунків.ід_операції_журналу_операцій
WHERE журнал_касових_операцій.дата_час_проведення > NOW() - '30 days'::INTERVAL
AND журнал_операцій_юридичних_осіб.дата > NOW() - '30 days'::INTERVAL
GROUP BY працівники.ПІБ;

-- юрид особи без кредитів та номера їх рахунків++++++++++++++=
SELECT юридичні_особи.повна_назва AS юридичні_особи, рахунки_юридичних_осіб.номер_рахунку
FROM юридичні_особи LEFT JOIN рахунки_юридичних_осіб ON юридичні_особи.ід = рахунки_юридичних_осіб.ід_юридичної_особи
INNER JOIN кредити ON юридичні_особи.ід = рахунки_юридичних_осіб.ід_юридичної_особи
WHERE рахунки_юридичних_осіб.ід_юридичної_особи IS NULL
AND юридичні_особи.ід = кредити.ід_юридичної_особи;

-- фіз та юр особи, загальна комісія, яку вони сплатили за кожну з послуг(віз рекурсів), загальна кожного клієнта++++++++++++++
SELECT фізичні_особи.ПІБ AS особи, журнал_поповнень_розрахункових_рахунків.комісія AS розрахункові_рахунки, 
 	журнал_поповнень_карткових_рахунків.комісія AS карткові_рахунки, журнал_поповнень_мобільних.комісія AS поповнення_мобільних,
	журнал_валютообмінних_операцій.комісія AS валютообмінні_операції, журнал_поповнень_розрахункових_рахунків.комісія + 
																 журнал_поповнень_карткових_рахунків.комісія + 
																 журнал_поповнень_мобільних.комісія +
																 журнал_валютообмінних_операцій.комісія AS загальна_комісія
FROM фізичні_особи, журнал_поповнень_мобільних, 
	журнал_поповнень_карткових_рахунків, журнал_поповнень_розрахункових_рахунків, 
	журнал_касових_операцій, журнал_валютообмінних_операцій
WHERE фізичні_особи.ід = журнал_касових_операцій.ід_фізичної_особи
AND журнал_касових_операцій.ід = журнал_поповнень_розрахункових_рахунків.журнал_касових_операцій_ід
AND журнал_касових_операцій.ід = журнал_поповнень_карткових_рахунків.ід_операції_журналу_операцій
AND журнал_касових_операцій.ід = журнал_поповнень_мобільних.журнал_касових_операцій_ід
AND журнал_касових_операцій.ід = журнал_валютообмінних_операцій.журнал_касових_операцій_ід;

-- підрозділи, професії, планована кількість та поточна, відсотки+++++++++++++++++++++
SELECT * FROM
	(SELECT підрозділи.назва AS підрозділи, штатний_розпис.назва_посади AS посади, 
		штатний_розпис.планова_кількість_працівників, COUNT(працівники.ід) AS кількість_працівників,
		rank() OVER (PARTITION BY штатний_розпис.назва_посади ORDER BY COUNT(працівники.ід) DESC)
		--штатний_розпис.планова_кількість_працівників / COUNT(працівники.ід) * 100 AS відсоткове_співвідношення
	FROM підрозділи INNER JOIN штатний_розпис ON підрозділи.ід = штатний_розпис.ід_підрозділу
		INNER JOIN працівники ON штатний_розпис.ід = працівники.ід_штатного_розпису
	GROUP BY підрозділи.назва, штатний_розпис.назва_посади, штатний_розпис.планова_кількість_працівників) AS ccc
WHERE rank = 1;

-- загальна сума обміну кожної валюти++++++++++++++++++++++++++++
SELECT * FROM
	(SELECT довідник_валют.назва, SUM(журнал_валютообмінних_операцій.сума_валюти_купівлі) AS сума_валюти_купівлі, 
	 	курси_валют.вартість_придбання, SUM(журнал_валютообмінних_операцій.сума_валюти_обміну) AS сума_валюти_обміну, 
	 	курси_валют.вартіть_продажі, курси_валют.дата_час_встановлення_курсу AS час_встановлення_курсу
	FROM довідник_валют INNER JOIN журнал_валютообмінних_операцій ON довідник_валют.ід = журнал_валютообмінних_операцій.ід_валюти
		INNER JOIN курси_валют ON довідник_валют.ід = курси_валют.ід_валюти
	GROUP BY довідник_валют.назва, курси_валют.вартість_придбання, курси_валют.вартіть_продажі, курси_валют.дата_час_встановлення_курсу) AS ccc
WHERE час_встановлення_курсу IN (SELECT час_встановлення_курсу 
							   FROM (SELECT довідник_валют.назва, MAX(курси_валют.дата_час_встановлення_курсу) AS час_встановлення_курсу
									 FROM довідник_валют INNER JOIN курси_валют ON довідник_валют.ід = курси_валют.ід_валюти
									 GROUP BY довідник_валют.назва) AS ccc);

				 ---------------------------------------------------------------
                 --                      ПРЕДСТАВЛЕННЯ                         --
				 ---------------------------------------------------------------
-- інформація про працівників+++++++++++++++++++++
CREATE VIEW інформація_про_працівників(працівники, вік, номер_телефону, дата_народження, адреса_проживання, сімейний_стан, стать, посада, підрозділ) AS
(SELECT працівники.ПІБ, DATE_PART('year',NOW()::timestamp::date) - DATE_PART('year', працівники.дата_народження::date),
	працівники.номер_телефону, працівники.дата_народження, працівники.адреса_проживання, працівники.сімейний_стан,
	працівники.стать, штатний_розпис.назва_посади, підрозділи.назва
FROM підрозділи INNER JOIN штатний_розпис ON підрозділи.ід = штатний_розпис.ід_підрозділу
 INNER JOIN працівники ON штатний_розпис.ід = працівники.ід_штатного_розпису);

SELECT * FROM інформація_про_працівників;

-- інформація про фізичних осіб+++++++++++++++++++++
CREATE VIEW інформація_про_фізичних_осіб(фізичні_особи, вік, номер_телефону, дата_народження, адреса_проживання, сімейний_стан, стать, номер_рахунку) AS
(SELECT фізичні_особи.ПІБ, DATE_PART('year',NOW()::timestamp::date) - DATE_PART('year', фізичні_особи.дата_народження::date),
	фізичні_особи.номер_телефону, фізичні_особи.дата_народження, фізичні_особи.адреса_проживання, фізичні_особи.сімейний_стан,
	фізичні_особи.стать, ARRAY_AGG(карткові_рахунки.номер_рахунку)
FROM фізичні_особи INNER JOIN карткові_рахунки ON фізичні_особи.ід = карткові_рахунки.ід_фізичної_особи
GROUP BY фізичні_особи.ПІБ, фізичні_особи.номер_телефону, 
 	фізичні_особи.дата_народження, фізичні_особи.адреса_проживання, фізичні_особи.сімейний_стан,
	фізичні_особи.стать);

SELECT * FROM інформація_про_фізичних_осіб;

-- інформація про юридичних осіб+++++++++++++++++++++
CREATE VIEW інформація_про_юридичних_осіб(повна_назва, коротка_назва, дата_реєстрації, керівник, номер_рахунку) AS
(SELECT юридичні_особи.повна_назва, юридичні_особи.коротка_назва, 
 	юридичні_особи.дата_реєстрації,
	фізичні_особи.ПІБ, ARRAY_AGG(рахунки_юридичних_осіб.номер_рахунку)
FROM фізичні_особи INNER JOIN юридичні_особи ON фізичні_особи.ід = юридичні_особи.ід_керівника
 INNER JOIN рахунки_юридичних_осіб ON юридичні_особи.ід = рахунки_юридичних_осіб.ід_юридичної_особи
GROUP BY юридичні_особи.повна_назва, юридичні_особи.дата_реєстрації, юридичні_особи.коротка_назва, фізичні_особи.ПІБ);

SELECT * FROM інформація_про_юридичних_осіб;

-- інформація про кожну операцію з журналу++++++++++++++++++++
CREATE VIEW інформація_про_погашення_кредитів(ід_кредиту, юридична_особа, залишок_до_погашення, сума_до_погашення, прострочений_кредит, сума_строкових_відсотків, сума_прострочених_відсотків, сума_пені) AS
(SELECT кредити.ід, юридичні_особи.повна_назва, графіки_погашень_кредитів.залишок_до_погашення, 
 	графіки_погашень_кредитів.сума_кредиту_до_погашення_згідно_графіку, 
 	графіки_погашень_кредитів.прострочений_кредит, графіки_погашень_кредитів.сума_строкових_відсотків, 
 	графіки_погашень_кредитів.сума_прострочених_відсотків, графіки_погашень_кредитів.сума_пені
FROM юридичні_особи INNER JOIN кредити ON юридичні_особи.ід = кредити.ід_юридичної_особи
 INNER JOIN графіки_погашень_кредитів ON кредити.ід = графіки_погашень_кредитів.ід_кредиту);

SELECT * FROM інформація_про_погашення_кредитів;

-- топ три підрозділи по кількості працівників++++++++++++++++++++
CREATE VIEW подрозділи_найб_ксть_клієнтів(ід_підрозділів, підрозділи, кількість_працівників) AS
(SELECT підрозділи.ід, підрозділи.назва, COUNT(працівники.ід)
FROM підрозділи INNER JOIN штатний_розпис ON підрозділи.ід = штатний_розпис.ід_підрозділу
	INNER JOIN працівники ON штатний_розпис.ід = працівники.ід_штатного_розпису
GROUP BY підрозділи.ід, підрозділи.назва
ORDER BY COUNT(працівники.ід) DESC
LIMIT 3);
-- посада та кількість працівників у цих підрозділах на цих посадах++++++++++++++++=
SELECT штатний_розпис.назва_посади, COUNT(працівники.ід)
								  FILTER(WHERE штатний_розпис.ід_підрозділу = (SELECT ід[1] 
																			FROM (SELECT ARRAY_AGG(ід_підрозділів) AS ід
															      			FROM подрозділи_найб_ксть_клієнтів) AS ccc)) AS ТОП_1,

								COUNT(працівники.ід)
								FILTER(WHERE штатний_розпис.ід_підрозділу = (SELECT ід[2] 
																			FROM (SELECT ARRAY_AGG(ід_підрозділів) AS ід
																				  FROM подрозділи_найб_ксть_клієнтів) AS ccc)) AS ТОП_2,
								COUNT(працівники.ід)
								FILTER(WHERE штатний_розпис.ід_підрозділу = (SELECT ід[3] 
																			FROM (SELECT ARRAY_AGG(ід_підрозділів) AS ід
																				  FROM подрозділи_найб_ксть_клієнтів) AS ccc)) AS ТОП_3 
FROM штатний_розпис INNER JOIN працівники ON штатний_розпис.ід = працівники.ід_штатного_розпису
GROUP BY штатний_розпис.назва_посади;

-- фізичні особи, що є юридичними, номера їх рахунків++++++++++++++++==========
CREATE VIEW рахунки_юрид_осіб(повна_назва, керівник, рахунки_керівника, юридичні_рахунки) AS
(SELECT юридичні_особи.повна_назва, фізичні_особи.ПІБ, ARRAY_AGG(карткові_рахунки.номер_рахунку), ARRAY_AGG(рахунки_юридичних_осіб.номер_рахунку)
FROM фізичні_особи, юридичні_особи, карткові_рахунки, рахунки_юридичних_осіб
WHERE фізичні_особи.ід = юридичні_особи.ід_керівника
AND юридичні_особи.ід = рахунки_юридичних_осіб.ід_юридичної_особи
AND фізичні_особи.ід = карткові_рахунки.ід_фізичної_особи
GROUP BY юридичні_особи.повна_назва, фізичні_особи.ПІБ);

SELECT * FROM рахунки_юрид_осіб;

-- валюта, яку найчастіше обмінюють та рахунки з нею++++++++++++++++++++++++
CREATE VIEW найбільш_обмінювана_валюта(валюта, кількість_обмінів, карти) AS
(SELECT довідник_валют.назва, COUNT(журнал_валютообмінних_операцій.сума_валюти_обміну), ARRAY_AGG(карткові_рахунки.ід)
FROM довідник_валют, журнал_валютообмінних_операцій, карткові_рахунки, види_карт
WHERE довідник_валют.ід = журнал_валютообмінних_операцій.ід_валюти
AND довідник_валют.ід = види_карт.ід_валюти
AND види_карт.ід = карткові_рахунки.види_карт_ід
GROUP BY довідник_валют.назва);

SELECT * FROM найбільш_обмінювана_валюта;

-- депозитні рахунки, відкриті по тарифах, комісія яких більша середньої

-- найпопулярніші послуги за останній місяць
SELECT 

-- прострочення кожного кредиту+++++++++++++++++=
CREATE VIEW прострочення_кредитів(ід_кредиту, юридична_особа, сума_прострочення, дата_останнього_платежу) AS
(SELECT * FROM 
	(SELECT кредити.ід, юридичні_особи.повна_назва, графіки_погашень_кредитів.прострочений_кредит + 
												графіки_погашень_кредитів.сума_прострочених_відсотків +
												графіки_погашень_кредитів.сума_пені,
												графіки_погашень_кредитів.дата,
			rank() OVER (PARTITION BY кредити.ід ORDER BY графіки_погашень_кредитів.дата ASC)
	FROM кредити, юридичні_особи, графіки_погашень_кредитів
	WHERE кредити.ід = графіки_погашень_кредитів.ід_кредиту
	AND юридичні_особи.ід = кредити.ід_юридичної_особи) AS cc
WHERE rank = 1);

SELECT * FROM довідник_валют;

                 ---------------------------------------------------------------
                 --                      ТРИГЕРИ                               --
				 ---------------------------------------------------------------
-- тригери для комісії для валют
DROP FUNCTION commission_currency_exchange();

CREATE FUNCTION commission_currency_exchange() RETURNS TRIGGER AS $$
BEGIN
	IF NEW.ід_валюти_купівлюі = 1 THEN
		NEW.комісія = NEW.сума_валюти_купівлі * 0.02;
		RETURN NEW;
	END IF;
END; $$
LANGUAGE plpgsql;

DROP TRIGGER check_IPN_code ON працівники;

CREATE TRIGGER set_commission_currency_exchange 
BEFORE INSERT ON журнал_валютообмінних_операцій
FOR EACH ROW
EXECUTE PROCEDURE commission_currency_exchange();

-- перевірка ІПН коду працівника
DROP FUNCTION check_IPN_code_function();

CREATE FUNCTION check_IPN_code_function() RETURNS TRIGGER AS $$
BEGIN
	IF (SELECT CHEKC_IPN(NEW.ІПН, NEW.стать, NEW.дата_народження)) THEN
		RETURN NEW;
	ELSE 
		RAISE EXCEPTION 'Невірно введено ІПН або дату народження: %, %', NEW.ІПН, NEW.дата_народження
      			USING HINT = 'Будь ласка, перевірте дані!';
	END IF;
END; $$
LANGUAGE plpgsql;

DROP TRIGGER check_IPN_code ON працівники;

CREATE TRIGGER check_IPN_code 
BEFORE INSERT ON працівники
FOR EACH ROW
EXECUTE PROCEDURE check_IPN_code_function();

-- операції з карткою
DROP FUNCTION card_operations();

CREATE FUNCTION card_operations() RETURNS TRIGGER AS $$
DECLARE 
	payment_type payment_type
BEGIN
	payment_type = (SELECT payment_type FROM журнал_касових_операцій WHERE ід = NEW.журнал_касових_операцій_ід);
	IF payment_type = 'картка' THEN 
		UPDATE карткові_рахунки SET залишок = залишок + NEW.сума + NEW.комісія;
		RETURN NEW;
	END IF;
END; $$
LANGUAGE plpgsql;

DROP TRIGGER set_card_operations ON журнал_поповнень_мобільних;

CREATE TRIGGER set_card_operations
BEFORE INSERT ON журнал_поповнень_мобільних
FOR EACH ROW
EXECUTE PROCEDURE check_IPN_code_function();

-- нарахування комісії при пооповненні мобільного
DROP FUNCTION commission_mobile_rechargee();

CREATE FUNCTION commission_mobile_rechargee() RETURNS TRIGGER AS $$
DECLARE
kodes VARCHAR[][];
commissions FLOAT[];
i INT = 1;
j INT = 1;
num_same_operator INT;
BEGIN
	kodes := array_fill(NULL::VARCHAR, array[6, 6]);
	kodes := (SELECT array[['Київстар', 'Vodafone Україна', 'Lificell', 'Інтертелеком', 'PEOPLEnet', 'ТриМоб'], ['+38067', '+38068', '+38096', '+38097', '+38098'], ['+38050', '+38066', '+38095', '+38099', NULL], ['+38063', '+38073', '+38093', NULL, NULL], ['+38092', NULL, NULL, NULL, NULL], ['+38091', NULL, NULL, NULL, NULL]]);
	commissions := array_fill(NULL::FLOAT, array[6, 6]);
	commissions := (SELECT array[0.02, 0.03, 0.02, 0.03, 0.04]);
	FOR i IN 1..6 LOOP
		FOR j in 1..5 LOOP
			IF (LEFT(NEW.номер_отримувача, 6))::VARCHAR = kodes[i][j] THEN
				NEW.оператор = kodes[1][j];
				NEW.комісія = NEW.сума * commissions[j];
				RETURN NEW;
			ELSE
				RAISE EXCEPTION 'Оператора з кодом % не існує', (LEFT(NEW.номер_отримувача, 6))::VARCHAR
      				USING HINT = 'Будь ласка, перевірте дані!';
			END IF;
		END LOOP;
	END LOOP;
END; $$
LANGUAGE plpgsql;

DROP TRIGGER set_commission_mobile_rechargee ON журнал_поповнень_мобільних;

CREATE TRIGGER set_commission_mobile_rechargee
BEFORE INSERT ON журнал_поповнень_мобільних
FOR EACH ROW
EXECUTE PROCEDURE commission_mobile_rechargee();

-- нарахування комісії при поповненнях карткових рахунків
DROP FUNCTION commission_kards_rechargee();

CREATE FUNCTION commission_kards_rechargee() RETURNS TRIGGER AS $$
DECLARE
commission_percent FLOAT;
BEGIN
	IF NEW.ід_картки_клієнта IS NULL THEN 
		NEW.комісія = NEW.сума_операції * 0.05;
		RETURN NEW;
	ELSE
		commission_percent = (SELECT тарифи_для_фізичних_осіб.комісія AS комісія 
							  FROM тарифи_для_фізичних_осіб, карткові_рахунки, види_карт
							  WHERE тарифи_для_фізичних_осіб.ід = види_карт.ід_тарифу
							  AND види_карт.ід = карткові_рахунки.види_карт_ід
							  AND карткові_рахунки.ід = NEW.ід_картки_клієнта);
		NEW.комісія = NEW.сума_операції * commission_percent;
		IF NEW.карта_отримувача IN (SELECT номер_рахунку FROM карткові_рахунки) THEN 
			UPDATE карткові_рахунки SET залишок = залишок - NEW.сума_операції - NEW.комісія WHERE ід = NEW.ід_картки_клієнта;
			UPDATE карткові_рахунки SET залишок = залишок + NEW.сума_операції WHERE номер_рахунку = NEW.картка_отримувача;
			RETURN NEW;
		ELSE 
			NEW.комісія = NEW.комісія + (NEW.комісія * 0.05);
			UPDATE карткові_рахунки SET залишок = залишок - NEW.сума_операції - NEW.комісія WHERE ід = NEW.ід_картки_клієнта;
			RETURN NEW;
		END IF;
	END IF;
END; $$
LANGUAGE plpgsql;

DROP TRIGGER set_commission_kards_rechargee ON журнал_поповнень_карткових_рахунків;

CREATE TRIGGER set_commission_kards_rechargee
BEFORE INSERT ON журнал_поповнень_карткових_рахунків
FOR EACH ROW
EXECUTE PROCEDURE commission_kards_rechargee();

-- нарахування комісії при поповненнях розрахункових рахунків
DROP FUNCTION commission_rated_rechargee();

CREATE FUNCTION commission_rated_rechargee() RETURNS TRIGGER AS $$
DECLARE
commission_percent FLOAT;
BEGIN
	IF NEW.ід_картки_клієнта IS NULL THEN 
		NEW.комісія = NEW.сума_валюти_платежу * 0.05;
		RETURN NEW;
	ELSE
		commission_percent = (SELECT тарифи_для_фізичних_осіб.комісія AS комісія 
							  FROM тарифи_для_фізичних_осіб, карткові_рахунки, види_карт
							  WHERE тарифи_для_фізичних_осіб.ід = види_карт.ід_тарифу
							  AND види_карт.ід = карткові_рахунки.види_карт_ід
							  AND карткові_рахунки.ід = NEW.ід_картки_клієнта);
		NEW.комісія = NEW.сума_операціїї * commission_percent;
		UPDATE карткові_рахунки SET залишок = залишок - NEW.сума_валюти_платежу - NEW.комісія WHERE ід = NEW.ід_картки_клієнта;
		RETURN NEW;
	END IF;
END; $$
LANGUAGE plpgsql;

DROP TRIGGER set_commission_rated_rechargee ON журнал_поповнень_розрахункових_рахунків;

CREATE TRIGGER set_commission_rated_rechargee
BEFORE INSERT ON журнал_поповнень_розрахункових_рахунків
FOR EACH ROW
EXECUTE PROCEDURE commission_rated_rechargee();

-- нарахування комісії у журналі операцій юридичних осіб
DROP FUNCTION commission_legal_entities();

CREATE FUNCTION commission_legal_entities() RETURNS TRIGGER AS $$
	BEGIN
	NEW.комісія = NEW.сума * 0.08;
	UPDATE рахунки_юридичних_осіб SET залишок = залишок + NEW.сума WHERE ід = NEW.ід_рахунку_юридичної_особи;
	RETURN NEW;
END; $$
LANGUAGE plpgsql;

DROP TRIGGER set_commission_legal_entities ON журнал_операцій_юридичних_осіб;

CREATE TRIGGER set_commission_legal_entities
BEFORE INSERT ON журнал_операцій_юридичних_осіб
FOR EACH ROW
EXECUTE PROCEDURE commission_legal_entities();

-- нарахуванна відсотків на депозинтий рахунок юридичної особи

-- якщо віп клієнт то створити нову карту йому (віп) (юрид_особи)
DROP FUNCTION vip_card();

CREATE FUNCTION vip_card() RETURNS TRIGGER AS $$
DECLARE
count_closed_credits INT = 0;
new_card_number BIGINT;
birthday DATE;
BEGIN
	count_closed_credits = (SELECT COUNT(ід)
							FROM кредити 
						    WHERE дата_закриття_кредиту <= планова_дата_закриття
							AND кредити.ід_юридичної_особи = NEW.ід_юридичної_особи);
	IF count_closed_credits = 3 THEN
		birthday = (SELECT фізичні_особи.дата_народження 
				   FROM фізичні_особи INNER JOIN юридичні_особи ON фізичні_особи.ід = юридичні_особи.ід_керівника
				   WHERE юридичні_особи.ід = NEW.ід_юридичної_особи);
		new_card_number = (SELECT ((99999999 - 10000000) * random() + 10000000)::BIGINT::VARCHAR 
						   || substring(birthday::VARCHAR for 4) 
						   || substring(birthday::VARCHAR from 6 for 2) 
						   || substring(birthday::VARCHAR from 9));
		INSERT INTO рахунки_юридичних_осіб(ід_юридичної_особи, тип_рахунку, номер_рахунку, ід_валюти, залишок, ід_тарифу) VALUES
  		(NEW.ід_юридичної_особи, 'кредитний віп', new_card_number, 1, 0, 2);
		RETURN NEW;
	END IF;
END; $$
LANGUAGE plpgsql;

DROP TRIGGER set_vip_card ON журнал_операцій_юридичних_осіб;

CREATE TRIGGER set_vip_card
AFTER UPDATE ON кредити
FOR EACH ROW
EXECUTE PROCEDURE vip_card();


                 ---------------------------------------------------------------
                 --                      ПРОЦЕДУРИ                             --
				 ---------------------------------------------------------------
-- історія поповнеь карт кожного з клієнтів
-- валюти, початок року, зараз, відсотки, на скільки змінилась ціна
SELECT довідник_валют.назва AS валюта, (SELECT вартість_придбання, MIN(дата_час_встановлення_курсу) FROM курси_валют GROUP BY вартість_придбання), 
									 (SELECT вартість_придбання, MAX(дата_час_встановлення_курсу) FROM курси_валют  GROUP BY вартість_придбання),
								     (SELECT вартість_продажі, MIN(дата_час_встановлення_курсу) FROM курси_валют GROUP BY вартість_продажі),
									 (SELECT вартість_продажі, MAX(дата_час_встановлення_курсу) FROM курси_валют GROUP BY вартість_продажі)
FROM довідник_валют INNER JOIN курси_валют ON довідник_валют.ід =курси_валют.ід_валюти

SELECT * FROM
	(SELECT підрозділи.назва AS підрозділи, працівники.ПІБ AS працівники, count(журнал_касових_операцій.ід_працівника),
			rank() OVER (PARTITION BY підрозділи.назва ORDER BY count(журнал_касових_операцій.ід_працівника) DESC)
	FROM підрозділи, працівники, журнал_касових_операцій, штатний_розпис 
	WHERE підрозділи.ід = штатний_розпис.ід_підрозділу
	AND штатний_розпис.ід = працівники.ід_штатного_розпису
	AND працівники.ід = журнал_касових_операцій.ід_працівника
	GROUP BY підрозділи.назва, працівники.ПІБ) AS ccc
WHERE rank <= 3;
SELECT працівники.ПІБ AS працівники, COUNT()
-- процедцра для погашення крадитів певної особи
-- перелік всіх операцій певної особи
-- за валютою вивести всі зміни вартості та відсотки, на скільки змінилась вартість, історія зміни за рік
-- історія певної людини певного дня
-- якийсь додатковий кредит

DROP PROCEDURE loans_repayment(client_name VARCHAR(55));
  
CALL loans_repayment('mvp ofice'); -- в кінці місяця
  
CREATE PROCEDURE loans_repayment(client_name VARCHAR(55)) AS $$
DECLARE 
    percent_term_interest NUMERIC(3,2);
	percent_overdue_interest NUMERIC(3,2);
	ransom MONEY;
	id_client INT;
	month_planned_repayment MONEY;
	balance_to_repayment MONEY;
	late_payment MONEY; -- прострочені платежі
	term_interest MONEY; -- строкові відсотки
	overdue_interest MONEY; -- прострочені відсотки
	credit_id INT; -- ід поточного кредиту
	set_month_planned_repayment MONEY;
	loan_amount MONEY; -- сума позики
	client_money MONEY;
BEGIN
    id_client = (SELECT ід FROM юридичні_особи WHERE повна_назва LIKE '%' || client_name || '%' OR коротка_назва LIKE '%' || client_name || '%');
	
	RAISE NOTICE 'client_name: %', id_client;
	
	IF id_client IS NULL THEN
		RAISE EXCEPTION 'Невірно введено дані про клієнта: %', id_client
      			USING HINT = 'Будь ласка, перевірте дані!';
	ELSE
		SELECT сума_позики, ід, відсотки_в_місяць_просточені / 100, відсотки_в_місяць_строкові / 100, сума_позики
		INTO loan_amount, credit_id, percent_term_interest, percent_overdue_interest, ransom
		FROM кредити
		WHERE ід_юридичної_особи = id_client AND дата_закриття_кредиту IS NULL;
		
		month_planned_repayment = loan_amount / 24; -- сума платежу в місяць
									
		balance_to_repayment = (SELECT залишок_до_погашення FROM графіки_погашень_кредитів -- залишок до погашення минулого платежу
						       WHERE ід_кредиту = credit_id
						       ORDER BY дата DESC
						       LIMIT 1);
		
		RAISE NOTICE 'balance_to_repayment: %, month_planned_repayment: %', balance_to_repayment, month_planned_repayment;
		
		IF balance_to_repayment IS NULL THEN
			
			term_interest = loan_amount * percent_term_interest;
			
			RAISE NOTICE 'term_interest: %, loan_amount: %, month_planned_repayment: %', term_interest, loan_amount, month_planned_repayment;
			
 			INSERT INTO графіки_погашень_кредитів(ід_кредиту, залишок_до_погашення, сума_кредиту_до_погашення_згідно_графіку, прострочений_кредит, сума_строкових_відсотків, сума_прострочених_відсотків, сума_пені) VALUES 
			(credit_id, loan_amount, month_planned_repayment, 0, term_interest, 0, 0);
		ELSE
			IF balance_to_repayment > month_planned_repayment THEN		
			
				SELECT прострочений_кредит + сума_кредиту_до_погашення_згідно_графіку, 
					   сума_строкових_відсотків + balance_to_repayment * percent_term_interest, 
				       сума_прострочених_відсотків * percent_overdue_interest
				INTO late_payment, term_interest, overdue_interest
				FROM графіки_погашень_кредитів
				WHERE ід_кредиту = credit_id
				ORDER BY дата DESC
			    LIMIT 1;
													
				IF late_payment = 0::MONEY THEN
					ransom = 0::MONEY;
				END IF;	
			END IF;
		END IF;
		client_money = (SELECT залишок FROM рахунки_юридичних_осіб -- зняття коштів з кредитного рахунку
		 			   WHERE ід_юридичної_особи = id_client);

		RAISE NOTICE 'client_money: %, late_payment: %, term_interest: %, overdue_interest: %', client_money, late_payment, term_interest, overdue_interest;

		IF client_money < ransom THEN
			ransom = ransom - client_money;
			client_money = 0::MONEY;
		ELSE 
			client_money = client_money - ransom;
			ransom = 0::MONEY;
		END IF;
		
		IF client_money < overdue_interest THEN
			overdue_interest = overdue_interest - client_money;
			client_money = 0::MONEY;
		ELSE 
			client_money = client_money - overdue_interest;
			overdue_interest = 0::MONEY;
		END IF;
		
		IF client_money < late_payment THEN
			late_payment = late_payment - client_money;
			client_money = 0::MONEY;
		ELSE 
			client_money = client_money - late_payment;
			late_payment = 0::MONEY;
		END IF;
		
		IF client_money < term_interest THEN
			term_interest = term_interest - client_money;
			client_money = 0::MONEY;
		ELSE 
			client_money = client_money - term_interest;
			term_interest = 0::MONEY; 
			
		END IF;
		
		IF client_money < month_planned_repayment THEN
			set_month_planned_repayment = month_planned_repayment - client_money;
			client_money = 0::MONEY;
		ELSE 
			client_money = client_money - month_planned_repayment;
			term_interest = 0::MONEY;
		END IF;
		
		balance_to_repayment = balance_to_repayment - (month_planned_repayment - set_month_planned_repayment);
		
		IF balance_to_repayment < 0::MONEY THEN
			balance_to_repayment = 0::MONEY;
			UPDATE кредити SET дата_закриття_кредиту = (SELECT CURRENT_TIMESTAMP)
            WHERE ід_фізичної_особи = id_client;
		END IF;
		
		RAISE NOTICE 'credit_id: %, loan_amount: %, month_planned_repayment: %, ransom: %', credit_id, loan_amount, month_planned_repayment, ransom;

		INSERT INTO графіки_погашень_кредитів(ід_кредиту, залишок_до_погашення, сума_кредиту_до_погашення_згідно_графіку, прострочений_кредит, сума_строкових_відсотків, сума_прострочених_відсотків, сума_пені) VALUES
 		(credit_id, loan_amount, month_planned_repayment, late_payment, term_interest, overdue_interest, ransom);
	END IF;
END $$
LANGUAGE plpgsql;

                 ---------------------------------------------------------------
                 --                      ФУНКЦІЇ                               --
				 ---------------------------------------------------------------
-- перевірка ІПН коду фізичної особи та юридичної особи коду єрдпоу
DROP FUNCTION CHEKC_IPN;

SELECT CHEKC_IPN('32855961', 'чоловік', '22-07-2002');

CREATE FUNCTION CHEKC_IPN (ipn_code VARCHAR(10), gender gender, birthday DATE)
RETURNS BOOLEAN AS $$
DECLARE
     count_of_days_to_birthday VARCHAR(5);
	 gender_number INT;
	 i INT;
	 summ INT;
	 res INT;
	 for_sum INT[];
BEGIN
	IF char_length(ipn_code) = 10 THEN
		count_of_days_to_birthday = (LEFT(ipn_code, 5))::INT;
		gender_number = (LEFT(RIGHT(ipn_code, 2),1))::INT;
		IF DATE_DIFF('day', '31-12-1899', birthday)::INT = count_of_days_to_birthday::INT THEN
			IF gender_number % 2 = 0 AND gender = 'жінка' THEN
				RETURN TRUE;
			ELSIF gender_number % 2 != 0 AND gender = 'чоловік' THEN
				RETURN TRUE;
			ELSE
				RETURN FALSE;
			END IF;
		 END IF;
	ELSIF char_length(ipn_code) = 8 THEN
		i = 1;
		summ = 0;
		for_sum := array_fill(null::int, array[7]);
		for_sum = (SELECT array[7, 1, 2, 3, 4, 5, 6]);
		LOOP 
		  EXIT WHEN i = 8;
		  IF ipn_code::INT < 30000000 OR ipn_code::INT > 60000000 THEN
		      summ = summ + RIGHT(LEFT(ipn_code, i), 1)::INT * i; 
		  ELSE 
		  	  summ = summ + RIGHT(LEFT(ipn_code, i), 1)::INT * for_sum[i]; 
		  END IF;
		  i = i + 1;
 		END LOOP;
		res = MOD(summ, 11);
		IF res > 10 THEN
			summ = 0;
			LOOP 
			  EXIT WHEN i = 8; 
			  IF ipn_code::INT < 30000000 OR ipn_code::INT > 60000000 THEN
			      summ = summ + RIGHT(LEFT(ipn_code, i), 1)::INT * (i + 2); 
			  ELSE 
			  	  summ = summ + RIGHT(LEFT(ipn_code, i), 1)::INT * (for_sum[i] + 2); 
			  END IF;
			  i = i + 1;
   			END LOOP ;
		END IF;
		res = MOD(summ, 11);
		IF res = RIGHT(ipn_code, 1)::INT THEN 
			RETURN TRUE;
		ELSE
			RETURN FALSE;
		END IF;
	ELSE 
		RETURN FALSE;
	END IF;
END;
$$ LANGUAGE plpgsql;
-------------------------------------------------------------------------------
-- курс валюти
CREATE FUNCTION current_exchange_rate (currency VARCHAR(15)) 
RETURNS TABLE(
	вартість_придбання MONEY,
	вартість_продажі MONEY) AS $$
BEGIN
	IF currency ~ '^[0-9]+$' THEN
		RETURN QUERY
             SELECT курси_валют.вартість_придбання, курси_валют.вартіть_продажі 
			 FROM курси_валют 
			 WHERE ід_валюти = currency::INT 
			 ORDER BY дата_час_встановлення_курсу DESC 
			 LIMIT 1;
	ELSIF currency ~ '^[^0-9]+$' THEN
		RETURN QUERY
             SELECT курси_валют.вартість_придбання, курси_валют.вартіть_продажі 
			 FROM курси_валют, довідник_валют 
			 WHERE назва = currency OR коротка_назва = currency  
			 ORDER BY дата_час_встановлення_курсу DESC 
			 LIMIT 1;
	ELSE
		RAISE EXCEPTION 'Невірно введено валюту: %', currency
      			USING HINT = 'Будь ласка, перевірте дані!';
	END IF;
END;
$$ LANGUAGE plpgsql;

SELECT * FROM курси_валют

DROP FUNCTION current_exchange_rate;

SELECT * FROM current_exchange_rate('2');
---  --------------------------------------------------------------
-- зарплата працівникам в місяць
-- якщо за місяць більше певної кількості послуг - премія
-- за кількість проведених послуг
-- доплата за заміну відсутнього працівника
-- за роботу у вихідний день
-----------------

-- 1. визначення зп за відпрацьований час:
-- зп = оклад / 21 роб. день * к-сть відпрацьованих днів + надбавка + премія
-- 2. визначення мінімальної зп за цей час:
-- мін. зп = мін. оклад / 21 роб. день * к-сть відпрацьованих днів
-- 3. якщо зп < мін. зп та посадовий оклад < мін, тоді розрахунок доплати до зп:
-- доплата до зп = мін зп - зп
-- 4. розрахунок загальної зп за місяць:
-- загальна зп = зп + доплата + відпускні(лікарняні)


-- аргументи: ід, оклад, кількість відпрацьованих днів, кількість років на ароботі, 
-----------------------------------------------------------------
-- розрахунок відпускних днів

-- 
-----------------------------------------------------------------
-- надбавка працівникам в місяць

-- аргументи: ід, оклад, кількість відпрацьованих днів, кількість років н ароботі, 
                 ---------------------------------------------------------------
                 --                      КОРИСТУВАЧІ                           --
				 ---------------------------------------------------------------
